Revit 2024 API
ExportLinetypeTableIterator Methods
The ExportLinetypeTableIterator type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsDone
 Identifies if the iteration has completed.
MoveNext
 Increments the iterator to the next item.
Reset
 Resets the iterator to the initial state.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ExportLinetypeTableIterator Class
Autodesk.Revit.DB Namespace